In [60]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          258                 53
1        UAS1         Fisika                          283                 83
2        UTS2         Fisika                          452                 43
3        UAS2         Fisika                          535                 86
4        UTS1     Matematika                          349                 69
5        UAS1     Matematika                          216                 93
6        UTS2     Matematika                          542                 93
7        UAS2     Matematika                          535                 55
8        UTS1     Statistika                          403                 88
9        UAS1     Statistika                          217                 62
10       UTS2     Statistika                          453                 83
11       UAS2     Statistika                          654                 78



---



---

## Soal 1. Data Cleaning

Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil

*   Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil
*   Tipe Ujian dan Mata pelajaran apakah yang memiliki rata2 nilai terkecil?

In [10]:
#code here
display(df.sort_values("Rata2 Nilai Ujian", ascending=False))

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
10       UTS2     Statistika                          255                 94
0        UTS1         Fisika                          655                 85
6        UTS2     Matematika                          317                 83
9        UAS1     Statistika                          714                 83
3        UAS2         Fisika                          692                 74
1        UAS1         Fisika                          498                 57
5        UAS1     Matematika                          596                 57
8        UTS1     Statistika                          203                 53
11       UAS2     Statistika                          495                 48
2        UTS2         Fisika                          503                 45
4        UTS1     Matematika                          787                 42
7        UAS2     Matematika                          265                 42

Expected output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1iv8P-LDdN3WpTVX9qST3kL7QSNSDiOc2)

Nilai terkecil dimiliki oleh tipe ujian UAS2 dan mata pelajaran Matematika



---



---

<h2>Soal 2: Data Restructuring</h2>

Jelaskan itu pivoting dan melting data

##### Pivoting adalah melakukan transformasi tabel data dari baris menjadi kolom
##### Melting adalah melakukan transformasi tabel data dari kolom menjadi baris, umumnya digunakan jika terdapat satu atau lebih column yang merupakan identifier variable, dan columnn lain adalah measure variabel



---



---

<h2>Soal 3: Reshaping Data 1</h2>

In [20]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          731                 66
1        UAS1         Fisika                          373                 52
2        UTS2         Fisika                          685                 97
3        UAS2         Fisika                          327                 59
4        UTS1     Matematika                          256                 66
5        UAS1     Matematika                          484                 88
6        UTS2     Matematika                          368                 97
7        UAS2     Matematika                          402                 70
8        UTS1     Statistika                          754                 69
9        UAS1     Statistika                          781                 91
10       UTS2     Statistika                          367                 84
11       UAS2     Statistika                          429                 81

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [25]:
#code here
df_pivot = pd.pivot(df, index="Tipe Ujian", columns="Mata Pelajaran", values=["Rata2 Nilai Ujian","Rata2 Waktu Belajar (menit)"])
display(df_pivot)

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          52         88         91
UAS2                          59         70         81
UTS1                          66         66         69
UTS2                          97         97         84

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   373        484        781
UAS2                                   327        402        429
UTS1                                   731        256        754
UTS2                                   685        368        367

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)



---



---

<h2>Soal 4: Reshaping Data 2</h2>

In [55]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data)
df

     Hari  Kebun Binatang  Dufan  Disney  Bali
0   Sabtu             271    501    1000   900
1  Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [57]:
#code here
pd.melt(df, id_vars=['Hari'],  value_vars=['Kebun Binatang', 'Dufan', 'Disney', 'Bali'], var_name='Tempat Hiburan', value_name='Pengunjung')

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)



---



---

<h2>Soal 5: Data Enrichment</h2>

Lakukan binning data menggunakan qcut sehingga sesuai hasil yang diharapkan

In [67]:
#code here]
labels = ["Tidak Lulus","Remedial","Lulus"]
df["Keterangan kelulusan"]=pd.qcut(df["Rata2 Nilai Ujian"], q=3, labels=labels)
display(df)

,Tipe Ujian,Mata Pelajaran,Rata2 Waktu Belajar (menit),Rata2 Nilai Ujian,Keterangan kelulusan
0,UTS1,Fisika,258,53,Tidak Lulus
1,UAS1,Fisika,283,83,Remedial
2,UTS2,Fisika,452,43,Tidak Lulus
3,UAS2,Fisika,535,86,Lulus
4,UTS1,Matematika,349,69,Remedial
5,UAS1,Matematika,216,93,Lulus
6,UTS2,Matematika,542,93,Lulus
7,UAS2,Matematika,535,55,Tidak Lulus
8,UTS1,Statistika,403,88,Lulus
9,UAS1,Statistika,217,62,Tidak Lulus
10,UTS2,Statistika,453,83,Remedial
11,UAS2,Statistika,654,78,Remedial

Expected Output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1h2_u5_xhD1_QtPpItTj-o3lljHhnr4XS)



---



---